class SuraList {
  final suralistdiscription = [
    {
      "surasomuhlist": [
        {
          "suratittle": "জীবন নিয়ে উক্তি",
          "suradiscription": "জীবন নিয়ে উক্তি",
          "banglaonubad":
              "1.“স্বপ্ন সেটা নয়,\nযেটা মানুষ ঘুমিয়ে ঘুমিয়ে দেখে,\nস্বপ্ন সেটাই যেটা পূরনের প্রত্যাশা,\nমানুষকে ঘুমাতে দেয় না।”\n\n2.“প্রতিটি কাজ করার আগে\nঅন্তত একবার নিজেকে\nজিজ্ঞেস করুন কাজটি\nআপনি কেন করবেন।”\n\n3.“তােমার একটি ছােট্ট\nপদক্ষেপে হাজার বছরের\nসফলতার যাত্রার শুরু হতে পারে।”\n\n4.“যা করতে হবে তাই করাে।\nযতবার করতে হবে ততবার করাে।\nযতক্ষন না যা চাইছ তা\nসত্যি করতে পারছ।”\n\n5.“তুমি যদি কোন কক্ষের\nসবচেয়ে বুদ্ধিমান\nমানুষ হয়ে থাকো,\nতবে তুমি অবশ্যই ভুল\nকক্ষে অবস্থান করছো।”",
        },
        {
          "suratittle": "—স্বামী বিবেকানন্দ",
          "suradiscription": "—স্বামী বিবেকানন্দ",
          "banglaonubad":
              "1.“যদি সত্যিই মন থেকে কিছু করতে চাও তাহলে পথ পাবে,\nআর যদি না চাও তাহলে অজুহাত পাবে।”\n\n2.“এমন কাজ করে চলো যে তুমি হাসতে হাসতে মরবে\nআর জগৎ তোমার জন্য কাঁদবে।”\n\n3.“শুধু বড়ো লোক হয়ো না…\nবড় মানুষ হও।”\n\n4.“মহাবিশ্বের সীমাহীন পুস্তকালয়\nআপনার মনের ভীতর অবস্থিত”",
        },
        {
          "suratittle": "—আলবার্ট আইনস্টাইন",
          "suradiscription": "—আলবার্ট আইনস্টাইন",
          "banglaonubad":
              "1.যে ব্যক্তি কখনও ভুল করেনি,\nসে কখনও নতুন কিছু করার চেষ্টা করে না।\n\n2.যেই চিন্তাভাবনা দিয়ে আমরা আমাদের সমস্যাগুলি তৈরী করি,\nসেই চিন্তাভাবনা দিয়ে তার সমাধান করা অসম্ভব।\n\n3.আপনার জীবন যাপনের দুটি উপায় রয়েছে।\nপ্রথমটি হলো,\nকিছুই অলৌকিক ঘটনা নয়।\nআর অন্যটি হলো,\nসবকিছু একটি অলৌকিক ঘটনা।\n\n4.আপনি যেই জিনিসটাকে ছয় বছরের ছেলেকে বোঝাতে অক্ষম,\nসেই জিনিটা আপনি নিজেই ঠিক করে বুঝতে পারেননি।",
        },
        {
          "suratittle": "—এ পি জে আবদুল কালাম",
          "suradiscription": "—এ পি জে আবদুল কালাম",
          "banglaonubad":
              "1.আপনার স্বপ্নগুলি সত্য হওয়ার আগে আপনাকে স্বপ্ন দেখতে হবে।\n\n2.সূর্যের মতো উজ্জ্বল হতে গেলে,\nপ্রথমে সূর্যের মতো জ্বলতে হবে।\n\n3.পাঠদান একটি অত্যন্ত মহৎ পেশা\nযা কোনও ব্যক্তির চরিত্র, ক্ষমতা এবং ভবিষ্যতের আকার দেয়\nজনগণের কাছে একজন ভালো শিক্ষক হয়ে ওঠা\nআমার পক্ষে সবচেয়ে বড় সম্মান।\n\n4.আসুন আমরা আমাদের বর্তমানকে ত্যাগ করি\nযাতে আমাদের পরবর্তী প্রজন্মের আগামীকাল আরও সুন্দর হয়ে উঠুক।",
        },
        {
          "suratittle": "—শরৎচন্দ্র",
          "suradiscription": "—শরৎচন্দ্র",
          "banglaonubad":
              "1.“সাদা আলো যেমন বাঁকা কাঁচের মধ্যে রঙিন হয়ে ওঠে, ন্যায়ও তেমনি অন্যায়, অধর্ম, পাপ,\nতাপের বাঁকা পথ দিয়ে দয়া, মায়া, ক্ষমায় বিচিত্র হয়ে দেখা যায়।”\n\n2.“যাহাকে ভালবাসি, সে যদি ভাল না বাসে, এমন কি ঘৃণাও করে, তাও বোধ করি সহ্য হয়, কিন্তু\nযাহার ভালবাসা পাইয়াছি বলিয়া বিশ্বাস করিয়াছি, সেইখানে ভুল ভাঙ্গিয়া যাওয়াটাই নিদারুন।\nপূর্বেরটা ব্যথাই দেয়, কিন্তু শেষেরটা ব্যথাও দেয়, অপমানও করে। আবার এ ব্যথার প্রতিকার\nনাই, এ অপমানের নালিশ নাই।”\n\n3.“লড়াই-ঝগড়া বাদাবাদি করে আর যাকেই পাওয়া যাক না, ধর্ম-বস্তুটিকে পাবার জো নেই।”\n\n4.“যে ভালবাসে, তাহাকে ঘৃণা করার অপবাদ দেওয়ার মত গুরুতর শাস্তি আর নাই, এ কথা\nভালবাসাই বলিয়া দেয়।”\n\n5.“আজ তাহার কেউ নাই; তাহাকে ভালবাসিতে, তাহাকে ঘৃণা করিতে, তাহাকে রক্ষা করিতে,\nতাহাকে হত্যা করিতে, কোথাও কেহ নাই; সংসারে সে একেবারেই সঙ্গ-বিহীন!”",
        },
        {
          "suratittle": "—রবীন্দ্রনাথ ঠাকুর",
          "suradiscription": "—রবীন্দ্রনাথ ঠাকুর",
          "banglaonubad":
              "",
        },
        {
          "suratittle": "সূরা আল ইখলাস",
          "suradiscription": "সূরা আল ইখলাস",
          "banglaonubad":
              "আরবিঃ\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِقُلْ هُوَ اللَّهُ أَحَدٌ\nاللَّهُ الصَّمَد\nلَمْ يَلِدْ وَلَمْ يُولَدْ\nوَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ\nউচ্চারণঃ\nবিসমিল্লাহির রাহমানির রাহীম\nক্বুলহু আল্লাহু আহাদ। আল্লাহুস সামাদ। লাম ইয়ালিদ ওয়া লাম ইউলাদ। ওয়া লাম ইয়া কুল্লাহু কুফুওয়ান আহাদ।\nঅর্থঃ\nবলুন, তিনি আল্লাহ, এক, আল্লাহ অমুখাপেক্ষী, তিনি কাউকে জন্ম দেননি এবং কেউ তাকে জন্ম দেয়নি এবং তার সমতুল্য কেউ নেই।\n",
        },
        {
          "suratittle": "সূরা মাউ'ন",
          "suradiscription": "সূরা মাউ'ন",
          "banglaonubad":
              "আরবি সূরাঃ\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِأَرَأَيْتَ الَّذِي يُكَذِّبُ بِالدِّينِ فَذَٰلِكَ الَّذِي يَدُعُّ الْيَتِيمَ وَلَا يَحُضُّ عَلَىٰ طَعَامِ الْمِسْكِينِ فَوَيْلٌ لِّلْمُصَلِّينَ الَّذِينَ هُمْ عَن صَلَاتِهِمْ سَاهُونَ الَّذِينَ هُمْ يُرَاءُون وَيَمْنَعُونَ الْمَاعُونَ\nউচ্চারণঃ\nবিসমিল্লাহির রাহমানির রাহীম\nআরা-আইতাল্লাযি ইউ কায্যাবু বিদ্দ্বীন। ফাযালিকাল লাযি ইয়াদুউ'ঊল ইয়াতীম। ওয়ালা ইয়াহুদ্দু আ'লা ত্বামিল মিসকীন। ফাইয়াও লুল্লাল-মুসাল্লীন। আল্লাযিনাহুম আ'ন সালাতিহিম সাহুন। আল্লাযিনা হুম ইউরা উন। ওয়া ইয়ামনাউ'নাল মা'ঊন।\nঅর্থঃ\nপরম করুণাময় ও অসীম দয়ালু আল্লাহর নামে শুরু করছি\nআপনি কি দেখেছেন তাকে, যে বিচারদিবসকে মিথ্যা বলে? সে সেই ব্যক্তি, যে এতীমকে গলা ধাক্কা দেয় এবং মিসকীনকে অন্ন দিতে উৎসাহিত করে না। অতএব দুর্ভোগ সেসব নামাযীর, যারা তাদের নামায সম্বন্ধে বে-খবর, যারা তা লোক-দেখানোর জন্য করে এবং নিত্য ব্যবহার্য্য বস্তু অন্যকে দেয় না।\n",
        },
        {
          "suratittle": "সূরা কুরাইশ",
          "suradiscription": "সূরা কুরাইশ",
          "banglaonubad":
              "আরবি সূরাঃ\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\nلِإِيلَافِ قُرَيْشٍ\nإِيلَافِهِمْ رِحْلَةَ الشِّتَاءِ وَالصَّيْفِ\nفَلْيَعْبُدُوا رَبَّ هَٰذَا الْبَيْتِ \nالَّذِي أَطْعَمَهُم مِّن جُوعٍ وَآمَنَهُم مِّنْ خَوْفٍ\nবিসমিল্লাহির রাহমানির রাহীম\nলি ইলাফি ক্বুরাইশ; ঈলা ফিহিম রিহ লাতাশশিতা ইওয়াসসাইফ। ফাল ইয়া'বুদু রাব্বা হাযাল বাইত। আল্লাযি আত আ'মাহুম মিন যু'ঈ। ওয়া আমারাহুম মিন খাউফ।\nঅর্থঃ\nপরম করুণাময় ও অসীম দয়ালু আল্লাহর নামে শুরু করছি\nকোরাইশের আসক্তির কারণে, আসক্তির কারণে তাদের শীত ও গ্রীষ্মকালীন সফরের। অতএব তারা যেন এবাদত করে এই ঘরের পালনকর্তার যিনি তাদেরকে ক্ষুধায় আহার দিয়েছেন এবং যুদ্ধভীতি থেকে তাদেরকে নিরাপদ করেছেন।\n",
        },
        {
          "suratittle": "সূরা ফীল",
          "suradiscription": "সূরা ফীল",
          "banglaonubad":
              "আরবি সূরাঃ\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِأَلَمْ تَرَ كَيْفَ فَعَلَ رَبُّكَ بِأَصْحَابِ الْفِيلِ\nأَلَمْ يَجْعَلْ كَيْدَهُمْ فِي تَضْلِيلٍ\nوَأَرْسَلَ عَلَيْهِمْ طَيْرًا أَبَابِيلَ\nتَرْمِيهِم بِحِجَارَةٍ مِّن سِجِّيلٍ\nفَجَعَلَهُمْ كَعَصْفٍ مَّأْكُولٍ\nউচ্চারণঃ\nবিসমিল্লাহির রাহমানির রাহীম \nআলাম তারা কাইফা আ'লা রাব্বুকা বি-আসহাবিল ফীল। আলাম ইয়াজ-আ'ল কাইদাহুম ফি তাদলীল। ওয়া-আরসালা আলাইহিম তাইরান আবাবীল। তারমিহিম বিহিজা রাতিম্মিন সিজ্জিল। ফাযাআ'লাহুম কাআ'সফিম মা'কূল।\nঅর্থঃ\nপরম করুণাময় ও অসীম দয়ালু আল্লাহর নামে শুরু করছি আপনি কি দেখেননি আপনার পালনকর্তা হস্তীবাহিনীর সাথে কিরূপ ব্যবহার করেছেন? তিনি কি তাদের চক্রান্ত নস্যাৎ করে দেননি? তিনি তাদের উপর প্রেরণ করেছেন ঝাঁকে ঝাঁকে পাখী, যারা তাদের উপর পাথরের কংকর নিক্ষেপ করছিল। অতঃপর তিনি তাদেরকে ভক্ষিত তৃণসদৃশ করে দেন।\n",
        },
        {
          "suratittle": "সূরা আছর",
          "suradiscription": "সূরা আছর",
          "banglaonubad":
              "আরবিঃ\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِوَالْعَصْرِ\nإِنَّ الْإِنْسَانَ لَفِي خُسْرٍ\nإِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَتَوَاصَوْا بِالْحَقِّ وَتَوَاصَوْا بِالصَّبْرِ\nউচ্চারণঃ\nবিসমিল্লাহির রাহমানির রাহীম\n(১) ওয়াল ‘আছর\n(২) ইন্নাল ইনসা-না লাফী খুস্র\n(৩) ইল্লাল্লাযীনা আ-মানু ওয়া ‘আমিলুছ ছা-লেহা-তে, ওয়া তাওয়া-ছাও বিল হাকক্বে ওয়া তাওয়া-ছাও বিছ্ ছাব্র ।\nঅর্থঃ\nপরম করুণাময় ও অসীম দয়ালু আল্লাহর নামে শুরু করছি\n(১) কালের শপথ!\n(২) নিশ্চয়ই সকল মানুষ অবশ্যই ক্ষতির মধ্যে রয়েছে।\n(৩) তারা ব্যতীত যারা (জেনে-বুঝে) ঈমান এনেছে ও সৎকর্ম সম্পাদন করেছে এবং পরস্পরকে ‘হক’-এর উপদেশ দিয়েছে ও পরস্পরকে ধৈর্য্যের উপদেশ দিয়েছে।\n",
        },
        {
          "suratittle": "সূরা হুমাযাহ",
          "suradiscription": "সূরা হুমাযাহ",
          "banglaonubad":
              "আরবি সূরাঃ\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِوَيْلٌ لِكُلِّ هُمَزَةٍ لُمَزَةٍ (1\nالَّذِي جَمَعَ مَالًا وَعَدَّدَهُ (2\nيَحْسَبُ أَنَّ مَالَهُ أَخْلَدَهُ (3\nكَلَّا لَيُنْبَذَنَّ فِي الْحُطَمَةِ (4\nوَمَا أَدْرَاكَ مَا الْحُطَمَةُ (5\nنَارُ اللَّهِ الْمُوقَدَةُ (6\nالَّتِي تَطَّلِعُ عَلَى الْأَفْئِدَةِ (7\nإِنَّهَا عَلَيْهِمْ مُؤْصَدَةٌ (8\nفِي عَمَدٍ مُمَدَّدَةٍ (9\nউচ্চারণঃ\nবিসমিল্লাহির রাহমানির রাহীম\n(১) ওয়ায়লুল লেকুল্লে হুমাঝাতিল লুমাঝাহ\n(২) আল্লাযী জামা‘আ মা-লাওঁ ওয়া ‘আদ্দাদাহ\n(৩) ইয়াহ্সাবু আন্না মা-লাহূ আখলাদাহ\n(৪) কাল্লা লাইয়ুম্বাযান্না ফিল হুত্বামাহ\n(৫) ওয়া মা আদরা-কা মাল হুত্বামাহ্?\n(৬) না-রুল্লা-হিল মূক্বাদাহ\n(৭) আল্লাতী তাত্ত্বালি‘উ ‘আলাল আফ্ইদাহ\n(৮) ইন্নাহা ‘আলাইহিম মু’ছাদাহ\n(৯) ফী ‘আমাদিম মুমাদ্দাদাহ।\nঅর্থঃ\nপরম করুণাময় ও অসীম দয়ালু আল্লাহর নামে শুরু করছি\n(১) দুর্ভোগ সেই সব ব্যক্তির জন্য যারা পশ্চাতে নিন্দা করে ও সম্মুখে নিন্দা করে\n(২) এবং সম্পদ জমা করে ও গণনা করে\n(৩) সে ধারণা করে যে, তার মাল তাকে চিরস্থায়ী করে রাখবে\n(৪) কখনোই না। সে অবশ্য অবশ্যই নিক্ষিপ্ত হবে পিষ্টকারী হুত্বামাহর মধ্যে\n(৫) আপনি কি জানেন ‘হুত্বামাহ’ কি?\n(৬) এটা আল্লাহর প্রজ্জ্বলিত অগ্নি\n(৭) যা কলিজা পর্যন্ত পৌঁছে যাবে\n(৮) এটা তাদের উপরে পরিবেষ্টিত থাকবে\n(৯) দীর্ঘ স্তম্ভ সমূহে।\n",
        },
        {
          "suratittle": "সূরা নাসর",
          "suradiscription": "সূরা নাসর",
          "banglaonubad":
              "আরবি সূরাঃ\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِإِذَا جَاءَ نَصْرُ اللَّهِ وَالْفَتْحُ وَرَأَيْتَ النَّاسَ يَدْخُلُونَ فِي دِينِ اللَّهِ أَفْوَاجًا فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ إِنَّهُ كَانَ تَوَّابًا\nউচ্চারণঃ\nবিসমিল্লাহির রাহমানির রাহীম\nইজাযা আনাসরুল্লাহি ওয়াল ফাতহ। ওয়ারা আইতান্নাসা ইয়াদখুলুনা ফি-দ্বীনিল্লাহি আফওয়াজা। ফাসাব্বিহ বিহামদি রাব্বিকা ওয়াস্তাগফিরহ। ইন্নাহু কা'না তাওয়্যাবা।\nঅর্থঃ\nপরম করুণাময় ও অসীম দয়ালু আল্লাহর নামে শুরু করছি\nযখন আসবে আল্লাহর সাহায্য ও বিজয় এবং আপনি মানুষকে দলে দলে আল্লাহর দ্বীনে প্রবেশ করতে দেখবেন, তখন আপনি আপনার পালনকর্তার পবিত্রতা বর্ণনা করুন এবং তাঁর কাছে ক্ষমা প্রার্থনা করুন। নিশ্চয় তিনি ক্ষমাকারী।\n",
        },
      ]
    }
  ];
}
