class SuraList {
  final suralistdiscription = [
    {
      "surasomuhlist": [
        {
          "suratittle": "সূরা আল ফাতিহা",
          "suradiscription": "সূরা আল ফাতিহা",
          "banglaonubad":
              "আরবিঃ\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ\nالرَّحْمَٰنِ الرَّحِيمِ \nمَالِكِ يَوْمِ الدِّينِ\nإِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ\nاهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ\nصِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ\nউচ্চারণঃ\nবিসমিল্লাহির রাহমানির রাহীম \nআলহামদুলিল্লাহি রাব্বীল আ'লামীন। আররাহমানির রাহীম। মা-লিকী ইয়াউমিদ্দ্বীন। ইয়্যাকা-না'বুদু ওয়া ইয়্যাকা নাসতায়ীন। ইহদিনাস-সিরাতাল মুসতাক্বীম। সিরাত্বাল লাযিনা আন-আ'মতা আ'লাইহিম।গাইরিল মাগদুবি আ'লাইহিম। ওয়ালাদ্দুয়াল্লীন। আমীন।\nঅর্থঃ\nশুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।\nসমস্ত প্রশংসা বিশ্বজগতের প্রতিপালক আল্লাহর, যিনি পরম করুণাময়, পরম দয়াময় যিনি বিচার দিনের মালিক\nআমরা একমাত্র তোমারই ইবাদত করি এবং শুধুমাত্র তোমারই সাহায্য প্রার্থনা করি। আমাদেরকে সরল পথ দেখাও, সে সমস্ত লোকের পথ, যাদেরকে তুমি নেয়ামত দান করেছ। তাদের পথ নয়, যাদের প্রতি তোমার গজব নাযিল হয়েছে এবং যারা পথভ্রষ্ট হয়েছে।",
        },
        {
          "suratittle": "সূরা নাস",
          "suradiscription": "সূরা নাস",
          "banglaonubad":
              "আরবি সূরাঃ\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِقُلْ أَعُوذُ بِرَبِّ النَّاسِ\nمَلِكِ النَّاسِ\nإِلَٰهِ النَّاسِ\nمِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ\nالَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ\nمِنَ الْجِنَّةِ وَالنَّاسِ\nউচ্চারণঃ\nবিসমিল্লাহির রাহমানির রাহীম\nক্বুল আউযুবি রাব্বিন্নাস। মালিকিন্নাস। ইলাহিন্নাস। মিন শাররিল ওয়াসওয়াসিল খান্নাস। আল্লাযি ওয়াসইউসু ফিসুদুরিন্নাস। মিনাল জিন্নাতি ওয়ান্নাস।\nঅর্থঃ\nপরম করুণাময় ও অসীম দয়ালু আল্লাহর নামে শুরু করছি\nবলুন, আমি আশ্রয় গ্রহণ করিতেছি মানুষের পালনকর্তার, মানুষের অধিপতির, মানুষের মা’বুদের তার অনিষ্ট থেকে, যে কুমন্ত্রণা দেয় ও আত্নগোপন করে, যে কুমন্ত্রণা দেয় মানুষের অন্তরে, জ্বিনের মধ্য থেকে অথবা মানুষের মধ্য থেকে।\n",
        },
        {
          "suratittle": "সূরা ফালাক",
          "suradiscription": "সূরা ফালাক",
          "banglaonubad":
              "আরবিঃ\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِقُلْ أَعُوذُ بِرَبِّ الْفَلَقِ\nمِن شَرِّ مَا خَلَقَ\nوَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ\nوَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ\nوَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ\nউচ্চারণঃ\nবিসমিল্লাহির রাহমানির রাহীম\nক্বুল আউযুবি রাব্বিল ফালাক্ব। মিন শাররিমা খালাক্ব। ওয়ামিন শাররি গাসিক্বিন ইযা ওয়াক্বাব। ওয়ামিন শাররিন নাফফাসাতি ফিল ও'ক্বাদ। ওয়ামিন শাররি হাসিদিন ইযা হাসাদ।\nঅর্থঃ\nপরম করুণাময় ও অসীম দয়ালু আল্লাহর নামে শুরু করছি \nবলুন, আমি আশ্রয় গ্রহণ করছি প্রভাতের পালনকর্তার, তিনি যা সৃষ্টি করেছেন, তার অনিষ্ট থেকে, অন্ধকার রাত্রির অনিষ্ট থেকে, যখন তা সমাগত হয়, গ্রন্থিতে ফুঁৎকার দিয়ে জাদুকারিনীদের অনিষ্ট থেকে এবং হিংসুকের অনিষ্ট থেকে যখন সে হিংসা করে।\n",
        },
        {
          "suratittle": "সূরা আল কাওসার",
          "suradiscription": "সূরা আল কাওসার",
          "banglaonubad":
              "আরবি সূরাঃ\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِإِنَّا أَعْطَيْنَاكَ الْكَوْثَرَ\nفَصَلِّ لِرَبِّكَ وَانْحَرْ \nإِنَّ شَانِئَكَ هُوَ الْأَبْتَرُ\nউচ্চারণঃ\nবিসমিল্লাহির রাহমানির রাহীম\nইন্না আ ত্বাইনা কাল কাউসার। ফাসাল্লিলি রাব্বাকা ওয়ানহার। ইন্না শা নিয়াকা হুয়াল আবতার।\nঅর্থঃ\nপরম করুণাময় ও অসীম দয়ালু আল্লাহর নামে শুরু করছি\nনিশ্চয় আমি আপনাকে কাওসার দান করেছি। অতএব আপনার পালনকর্তার উদ্দেশ্যে নামায পড়ুন এবং কোরবানী করুন। যে আপনার শত্রু, সেই তো লেজকাটা, নির্বংশ।\n",
        },
        {
          "suratittle": "সূরা লাহাব",
          "suradiscription": "সূরা লাহাব",
          "banglaonubad":
              "আরবি সূরাঃ\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِتَبَّتْ يَدَا أَبِي لَهَبٍ وَتَبَّ\nمَا أَغْنَىٰ عَنْهُ مَالُهُ وَمَا كَسَبَ\nسَيَصْلَىٰ نَارًا ذَاتَ لَهَبٍ\nوَامْرَأَتُهُ حَمَّالَةَ الْحَطَبِ\nفِي جِيدِهَا حَبْلٌ مِّن مَّسَدٍ\nউচ্চারণঃ\nবিসমিল্লাহির রাহমানির রাহীম\nতাব্বাত ইয়াদা আবি লাহাবিউ ওয়াতাব্ব। মা আগনা আ'নহুমালুহু ওয়ামা কাসাব। সাইয়াসলা নারান যাতালাহাব। ওয়ামরা আতুহু হাম্মা লাতাল হাতাব। ফি যিদিহা হাবলুম্মিম মাসাদ।\nঅর্থঃ\nপরম করুণাময় ও অসীম দয়ালু আল্লাহর নামে শুরু করছি\nআবু লাহাবের হস্তদ্বয় ধ্বংস হোক এবং ধ্বংস হোক সে নিজে, কোন কাজে আসেনি তার ধন-সম্পদ ও যা সে উপার্জন করেছে। সত্বরই সে প্রবেশ করবে লেলিহান অগ্নিতে এবং তার স্ত্রীও – যে ইন্ধন বহন করে, তার গলদেশে হবে এক খর্জুরের রশি।\n",
        },
        {
          "suratittle": "সূরা কাফিরুন",
          "suradiscription": "সূরা কাফিরুন",
          "banglaonubad":
              "আরবি:\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِقُلْ يَا أَيُّهَا الْكَافِرُونَ\nلَا أَعْبُدُ مَا تَعْبُدُونَ\nوَلَا أَنتُمْ عَابِدُونَ مَا أَعْبُدُ\nوَلَا أَنَا عَابِدٌ مَّا عَبَدتُّمْ\nوَلَا أَنتُمْ عَابِدُونَ مَا أَعْبُدُ\nلَكُمْ دِينُكُمْ وَلِيَ دِينِ\nউচ্চারণঃ\nবিসমিল্লাহির রাহমানির রাহীম\nক্বুল ইয়া আইয়্যুহাল কাফিরুন। লা আ'বুদু মা তা'বুদ। ওয়ালা আনতুম আ'বিদুনা মা আ'বূদ। ওয়ালা আনা আ'বিদুম্মা আবাত্তুম। ওয়ালা আনতুম আ'বিদুনা মা আ'বুদ। লাকুম দ্বীনুকুম ওয়ালিয়াদ্বীন।",
        },
        {
          "suratittle": "সূরা আল ইখলাস",
          "suradiscription": "সূরা আল ইখলাস",
          "banglaonubad":
              "আরবিঃ\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِقُلْ هُوَ اللَّهُ أَحَدٌ\nاللَّهُ الصَّمَد\nلَمْ يَلِدْ وَلَمْ يُولَدْ\nوَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ\nউচ্চারণঃ\nবিসমিল্লাহির রাহমানির রাহীম\nক্বুলহু আল্লাহু আহাদ। আল্লাহুস সামাদ। লাম ইয়ালিদ ওয়া লাম ইউলাদ। ওয়া লাম ইয়া কুল্লাহু কুফুওয়ান আহাদ।\nঅর্থঃ\nবলুন, তিনি আল্লাহ, এক, আল্লাহ অমুখাপেক্ষী, তিনি কাউকে জন্ম দেননি এবং কেউ তাকে জন্ম দেয়নি এবং তার সমতুল্য কেউ নেই।\n",
        },
        {
          "suratittle": "সূরা মাউ'ন",
          "suradiscription": "সূরা মাউ'ন",
          "banglaonubad":
              "আরবি সূরাঃ\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِأَرَأَيْتَ الَّذِي يُكَذِّبُ بِالدِّينِ فَذَٰلِكَ الَّذِي يَدُعُّ الْيَتِيمَ وَلَا يَحُضُّ عَلَىٰ طَعَامِ الْمِسْكِينِ فَوَيْلٌ لِّلْمُصَلِّينَ الَّذِينَ هُمْ عَن صَلَاتِهِمْ سَاهُونَ الَّذِينَ هُمْ يُرَاءُون وَيَمْنَعُونَ الْمَاعُونَ\nউচ্চারণঃ\nবিসমিল্লাহির রাহমানির রাহীম\nআরা-আইতাল্লাযি ইউ কায্যাবু বিদ্দ্বীন। ফাযালিকাল লাযি ইয়াদুউ'ঊল ইয়াতীম। ওয়ালা ইয়াহুদ্দু আ'লা ত্বামিল মিসকীন। ফাইয়াও লুল্লাল-মুসাল্লীন। আল্লাযিনাহুম আ'ন সালাতিহিম সাহুন। আল্লাযিনা হুম ইউরা উন। ওয়া ইয়ামনাউ'নাল মা'ঊন।\nঅর্থঃ\nপরম করুণাময় ও অসীম দয়ালু আল্লাহর নামে শুরু করছি\nআপনি কি দেখেছেন তাকে, যে বিচারদিবসকে মিথ্যা বলে? সে সেই ব্যক্তি, যে এতীমকে গলা ধাক্কা দেয় এবং মিসকীনকে অন্ন দিতে উৎসাহিত করে না। অতএব দুর্ভোগ সেসব নামাযীর, যারা তাদের নামায সম্বন্ধে বে-খবর, যারা তা লোক-দেখানোর জন্য করে এবং নিত্য ব্যবহার্য্য বস্তু অন্যকে দেয় না।\n",
        },
        {
          "suratittle": "সূরা কুরাইশ",
          "suradiscription": "সূরা কুরাইশ",
          "banglaonubad":
              "আরবি সূরাঃ\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\nلِإِيلَافِ قُرَيْشٍ\nإِيلَافِهِمْ رِحْلَةَ الشِّتَاءِ وَالصَّيْفِ\nفَلْيَعْبُدُوا رَبَّ هَٰذَا الْبَيْتِ \nالَّذِي أَطْعَمَهُم مِّن جُوعٍ وَآمَنَهُم مِّنْ خَوْفٍ\nবিসমিল্লাহির রাহমানির রাহীম\nলি ইলাফি ক্বুরাইশ; ঈলা ফিহিম রিহ লাতাশশিতা ইওয়াসসাইফ। ফাল ইয়া'বুদু রাব্বা হাযাল বাইত। আল্লাযি আত আ'মাহুম মিন যু'ঈ। ওয়া আমারাহুম মিন খাউফ।\nঅর্থঃ\nপরম করুণাময় ও অসীম দয়ালু আল্লাহর নামে শুরু করছি\nকোরাইশের আসক্তির কারণে, আসক্তির কারণে তাদের শীত ও গ্রীষ্মকালীন সফরের। অতএব তারা যেন এবাদত করে এই ঘরের পালনকর্তার যিনি তাদেরকে ক্ষুধায় আহার দিয়েছেন এবং যুদ্ধভীতি থেকে তাদেরকে নিরাপদ করেছেন।\n",
        },
        {
          "suratittle": "সূরা ফীল",
          "suradiscription": "সূরা ফীল",
          "banglaonubad":
              "আরবি সূরাঃ\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِأَلَمْ تَرَ كَيْفَ فَعَلَ رَبُّكَ بِأَصْحَابِ الْفِيلِ\nأَلَمْ يَجْعَلْ كَيْدَهُمْ فِي تَضْلِيلٍ\nوَأَرْسَلَ عَلَيْهِمْ طَيْرًا أَبَابِيلَ\nتَرْمِيهِم بِحِجَارَةٍ مِّن سِجِّيلٍ\nفَجَعَلَهُمْ كَعَصْفٍ مَّأْكُولٍ\nউচ্চারণঃ\nবিসমিল্লাহির রাহমানির রাহীম \nআলাম তারা কাইফা আ'লা রাব্বুকা বি-আসহাবিল ফীল। আলাম ইয়াজ-আ'ল কাইদাহুম ফি তাদলীল। ওয়া-আরসালা আলাইহিম তাইরান আবাবীল। তারমিহিম বিহিজা রাতিম্মিন সিজ্জিল। ফাযাআ'লাহুম কাআ'সফিম মা'কূল।\nঅর্থঃ\nপরম করুণাময় ও অসীম দয়ালু আল্লাহর নামে শুরু করছি আপনি কি দেখেননি আপনার পালনকর্তা হস্তীবাহিনীর সাথে কিরূপ ব্যবহার করেছেন? তিনি কি তাদের চক্রান্ত নস্যাৎ করে দেননি? তিনি তাদের উপর প্রেরণ করেছেন ঝাঁকে ঝাঁকে পাখী, যারা তাদের উপর পাথরের কংকর নিক্ষেপ করছিল। অতঃপর তিনি তাদেরকে ভক্ষিত তৃণসদৃশ করে দেন।\n",
        },
        {
          "suratittle": "সূরা আছর",
          "suradiscription": "সূরা আছর",
          "banglaonubad":
              "আরবিঃ\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِوَالْعَصْرِ\nإِنَّ الْإِنْسَانَ لَفِي خُسْرٍ\nإِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَتَوَاصَوْا بِالْحَقِّ وَتَوَاصَوْا بِالصَّبْرِ\nউচ্চারণঃ\nবিসমিল্লাহির রাহমানির রাহীম\n(১) ওয়াল ‘আছর\n(২) ইন্নাল ইনসা-না লাফী খুস্র\n(৩) ইল্লাল্লাযীনা আ-মানু ওয়া ‘আমিলুছ ছা-লেহা-তে, ওয়া তাওয়া-ছাও বিল হাকক্বে ওয়া তাওয়া-ছাও বিছ্ ছাব্র ।\nঅর্থঃ\nপরম করুণাময় ও অসীম দয়ালু আল্লাহর নামে শুরু করছি\n(১) কালের শপথ!\n(২) নিশ্চয়ই সকল মানুষ অবশ্যই ক্ষতির মধ্যে রয়েছে।\n(৩) তারা ব্যতীত যারা (জেনে-বুঝে) ঈমান এনেছে ও সৎকর্ম সম্পাদন করেছে এবং পরস্পরকে ‘হক’-এর উপদেশ দিয়েছে ও পরস্পরকে ধৈর্য্যের উপদেশ দিয়েছে।\n",
        },
        {
          "suratittle": "সূরা হুমাযাহ",
          "suradiscription": "সূরা হুমাযাহ",
          "banglaonubad":
              "আরবি সূরাঃ\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِوَيْلٌ لِكُلِّ هُمَزَةٍ لُمَزَةٍ (1\nالَّذِي جَمَعَ مَالًا وَعَدَّدَهُ (2\nيَحْسَبُ أَنَّ مَالَهُ أَخْلَدَهُ (3\nكَلَّا لَيُنْبَذَنَّ فِي الْحُطَمَةِ (4\nوَمَا أَدْرَاكَ مَا الْحُطَمَةُ (5\nنَارُ اللَّهِ الْمُوقَدَةُ (6\nالَّتِي تَطَّلِعُ عَلَى الْأَفْئِدَةِ (7\nإِنَّهَا عَلَيْهِمْ مُؤْصَدَةٌ (8\nفِي عَمَدٍ مُمَدَّدَةٍ (9\nউচ্চারণঃ\nবিসমিল্লাহির রাহমানির রাহীম\n(১) ওয়ায়লুল লেকুল্লে হুমাঝাতিল লুমাঝাহ\n(২) আল্লাযী জামা‘আ মা-লাওঁ ওয়া ‘আদ্দাদাহ\n(৩) ইয়াহ্সাবু আন্না মা-লাহূ আখলাদাহ\n(৪) কাল্লা লাইয়ুম্বাযান্না ফিল হুত্বামাহ\n(৫) ওয়া মা আদরা-কা মাল হুত্বামাহ্?\n(৬) না-রুল্লা-হিল মূক্বাদাহ\n(৭) আল্লাতী তাত্ত্বালি‘উ ‘আলাল আফ্ইদাহ\n(৮) ইন্নাহা ‘আলাইহিম মু’ছাদাহ\n(৯) ফী ‘আমাদিম মুমাদ্দাদাহ।\nঅর্থঃ\nপরম করুণাময় ও অসীম দয়ালু আল্লাহর নামে শুরু করছি\n(১) দুর্ভোগ সেই সব ব্যক্তির জন্য যারা পশ্চাতে নিন্দা করে ও সম্মুখে নিন্দা করে\n(২) এবং সম্পদ জমা করে ও গণনা করে\n(৩) সে ধারণা করে যে, তার মাল তাকে চিরস্থায়ী করে রাখবে\n(৪) কখনোই না। সে অবশ্য অবশ্যই নিক্ষিপ্ত হবে পিষ্টকারী হুত্বামাহর মধ্যে\n(৫) আপনি কি জানেন ‘হুত্বামাহ’ কি?\n(৬) এটা আল্লাহর প্রজ্জ্বলিত অগ্নি\n(৭) যা কলিজা পর্যন্ত পৌঁছে যাবে\n(৮) এটা তাদের উপরে পরিবেষ্টিত থাকবে\n(৯) দীর্ঘ স্তম্ভ সমূহে।\n",
        },
        {
          "suratittle": "সূরা নাসর",
          "suradiscription": "সূরা নাসর",
          "banglaonubad":
              "আরবি সূরাঃ\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِإِذَا جَاءَ نَصْرُ اللَّهِ وَالْفَتْحُ وَرَأَيْتَ النَّاسَ يَدْخُلُونَ فِي دِينِ اللَّهِ أَفْوَاجًا فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ إِنَّهُ كَانَ تَوَّابًا\nউচ্চারণঃ\nবিসমিল্লাহির রাহমানির রাহীম\nইজাযা আনাসরুল্লাহি ওয়াল ফাতহ। ওয়ারা আইতান্নাসা ইয়াদখুলুনা ফি-দ্বীনিল্লাহি আফওয়াজা। ফাসাব্বিহ বিহামদি রাব্বিকা ওয়াস্তাগফিরহ। ইন্নাহু কা'না তাওয়্যাবা।\nঅর্থঃ\nপরম করুণাময় ও অসীম দয়ালু আল্লাহর নামে শুরু করছি\nযখন আসবে আল্লাহর সাহায্য ও বিজয় এবং আপনি মানুষকে দলে দলে আল্লাহর দ্বীনে প্রবেশ করতে দেখবেন, তখন আপনি আপনার পালনকর্তার পবিত্রতা বর্ণনা করুন এবং তাঁর কাছে ক্ষমা প্রার্থনা করুন। নিশ্চয় তিনি ক্ষমাকারী।\n",
        },
      ]
    }
  ];
}
